peterliu2/FreeRTOS/FreeRTOS/Demo/CORTEX_TM4C123GH6PGE_GCC/init/startup.c
//*****************************************************************************
//
// startup.c - Boot code for Stellaris.
//
// Copyright (c) 2005-2007 Luminary Micro, Inc.  All rights reserved.
//
// Software License Agreement
//
// Luminary Micro, Inc. (LMI) is supplying this software for use solely and
// exclusively on LMI's microcontroller products.
//
// The software is owned by LMI and/or its suppliers, and is protected under
// applicable copyright laws.  All rights are reserved.  Any use in violation
// of the foregoing restrictions may subject the user to criminal sanctions
// under applicable laws, as well as to civil liability for the breach of the
// terms and conditions of this license.
//
// THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
// OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
// MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
// LMI SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR
// CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
//
// This is part of revision 1049 of the Stellaris Driver Library.
//
//*****************************************************************************

#include <stdint.h>
#include "inc/hw_nvic.h"
#include "inc/hw_types.h"

//*****************************************************************************
//
// Forward declaration of the default fault handlers.
//
//*****************************************************************************
void Reset_Handler( void );
static void NMI_Handler( void );
static void HardFault_Handler( void );
static void Default_Handler( void );

//*****************************************************************************
//
// The entry point for the application.
//
//*****************************************************************************
extern int main(void);

/*----------------------------------------------------------------------------
  Exception / Interrupt Handler
 *----------------------------------------------------------------------------*/
/* Cortex-M4 Processor Exceptions */
//void NMI_Handler					(void) __attribute__ ((weak, alias("Default_Handler")));
//void HardFault_Handler			(void) __attribute__ ((weak, alias("Default_Handler")));
void MemManage_Handler				(void) __attribute__ ((weak, alias("Default_Handler")));
void BusFault_Handler				(void) __attribute__ ((weak, alias("Default_Handler")));
void UsageFault_Handler				(void) __attribute__ ((weak, alias("Default_Handler")));
void SVC_Handler					(void) __attribute__ ((weak, alias("Default_Handler")));
void DebugMon_Handler				(void) __attribute__ ((weak, alias("Default_Handler")));
void PendSV_Handler					(void) __attribute__ ((weak, alias("Default_Handler")));
void SysTick_Handler				(void) __attribute__ ((weak, alias("Default_Handler")));

/* ARMCM4 Specific Interrupts */
void GPIOA_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler")));
void GPIOB_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler")));
void GPIOC_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler")));
void GPIOD_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler")));
void GPIOE_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler")));
void UART0_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler")));
void UART1_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler")));
void SSI0_IRQHandler				(void) __attribute__ ((weak, alias("Default_Handler")));
void I2C0_IRQHandler                (void) __attribute__ ((weak, alias("Default_Handler")));
void PWM0_FAULT_IRQHandler          (void) __attribute__ ((weak, alias("Default_Handler")));
void PWM0_GE0_IRQHandler            (void) __attribute__ ((weak, alias("Default_Handler")));
void PWM0_GE1_IRQHandler            (void) __attribute__ ((weak, alias("Default_Handler")));
void PWM0_GE2_IRQHandler            (void) __attribute__ ((weak, alias("Default_Handler")));
void QEI0_IRQHandler                (void) __attribute__ ((weak, alias("Default_Handler")));
void ADC0_SEQ0_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler")));
void ADC0_SEQ1_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler")));
void ADC0_SEQ2_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler")));
void ADC0_SEQ3_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler")));
void WT01_IRQHandler                (void) __attribute__ ((weak, alias("Default_Handler")));
void TIMER_0A_IRQHandler            (void) __attribute__ ((weak, alias("Default_Handler")));
void TIMER_0B_IRQHandler            (void) __attribute__ ((weak, alias("Default_Handler")));
void TIMER_1A_IRQHandler            (void) __attribute__ ((weak, alias("Default_Handler")));
void TIMER_1B_IRQHandler            (void) __attribute__ ((weak, alias("Default_Handler")));
void TIMER_2A_IRQHandler            (void) __attribute__ ((weak, alias("Default_Handler")));
void TIMER_2B_IRQHandler            (void) __attribute__ ((weak, alias("Default_Handler")));
void ANALOG_CMP0_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler")));
void ANALOG_CMP1_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler")));
void ANALOG_CMP2_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler")));
void SYSTEM_CTL_IRQHandler          (void) __attribute__ ((weak, alias("Default_Handler")));
void FLASH_EEPROM_CTL_IRQHandler    (void) __attribute__ ((weak, alias("Default_Handler")));
void GPIOF_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler")));
void GPIOG_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler")));
void GPIOH_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler")));
void UART2_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler")));
void SSI1_IRQHandler				(void) __attribute__ ((weak, alias("Default_Handler")));
void TIMER_3A_IRQHandler            (void) __attribute__ ((weak, alias("Default_Handler")));
void TIMER_3B_IRQHandler            (void) __attribute__ ((weak, alias("Default_Handler")));
void I2C1_IRQHandler                (void) __attribute__ ((weak, alias("Default_Handler")));
void QEI1_IRQHandler                (void) __attribute__ ((weak, alias("Default_Handler")));
void CAN0_IRQHandler				(void) __attribute__ ((weak, alias("Default_Handler")));
void CAN1_IRQHandler				(void) __attribute__ ((weak, alias("Default_Handler")));
void HIB_MODULE_IRQHandler          (void) __attribute__ ((weak, alias("Default_Handler")));
void USB_IRQHandler				    (void) __attribute__ ((weak, alias("Default_Handler")));
void PWM_GE3_IRQHandler             (void) __attribute__ ((weak, alias("Default_Handler")));
void uDMA_SOFTWARE_IRQHandler       (void) __attribute__ ((weak, alias("Default_Handler")));
void uDMA_ERROR_IRQHandler          (void) __attribute__ ((weak, alias("Default_Handler")));
void ADC1_SEQ0_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler")));
void ADC1_SEQ1_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler")));
void ADC1_SEQ2_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler")));
void ADC1_SEQ3_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler")));
void GPIOJ_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler")));
void GPIOK_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler")));
void GPIOL_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler")));
void SSI2_IRQHandler				(void) __attribute__ ((weak, alias("Default_Handler")));
void SSI3_IRQHandler				(void) __attribute__ ((weak, alias("Default_Handler")));
void UART3_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler")));
void UART4_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler")));
void UART5_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler")));
void UART6_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler")));
void UART7_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler")));
void I2C2_IRQHandler                (void) __attribute__ ((weak, alias("Default_Handler")));
void I2C3_IRQHandler                (void) __attribute__ ((weak, alias("Default_Handler")));
void TIMER_4A_IRQHandler            (void) __attribute__ ((weak, alias("Default_Handler")));
void TIMER_4B_IRQHandler            (void) __attribute__ ((weak, alias("Default_Handler")));
void TIMER_5A_IRQHandler            (void) __attribute__ ((weak, alias("Default_Handler")));
void TIMER_5B_IRQHandler            (void) __attribute__ ((weak, alias("Default_Handler")));
void TIMER_32BIT_0A_IRQHandler      (void) __attribute__ ((weak, alias("Default_Handler")));
void TIMER_32BIT_0B_IRQHandler      (void) __attribute__ ((weak, alias("Default_Handler")));
void TIMER_32BIT_1A_IRQHandler      (void) __attribute__ ((weak, alias("Default_Handler")));
void TIMER_32BIT_1B_IRQHandler      (void) __attribute__ ((weak, alias("Default_Handler")));
void TIMER_32BIT_2A_IRQHandler      (void) __attribute__ ((weak, alias("Default_Handler")));
void TIMER_32BIT_2B_IRQHandler      (void) __attribute__ ((weak, alias("Default_Handler")));
void TIMER_32BIT_3A_IRQHandler      (void) __attribute__ ((weak, alias("Default_Handler")));
void TIMER_32BIT_3B_IRQHandler      (void) __attribute__ ((weak, alias("Default_Handler")));
void TIMER_32BIT_4A_IRQHandler      (void) __attribute__ ((weak, alias("Default_Handler")));
void TIMER_32BIT_4B_IRQHandler      (void) __attribute__ ((weak, alias("Default_Handler")));
void TIMER_32BIT_5A_IRQHandler      (void) __attribute__ ((weak, alias("Default_Handler")));
void TIMER_32BIT_5B_IRQHandler      (void) __attribute__ ((weak, alias("Default_Handler")));
void SYS_EXCEP_IRQHandler			(void) __attribute__ ((weak, alias("Default_Handler")));
void I2C4_IRQHandler                (void) __attribute__ ((weak, alias("Default_Handler")));
void I2C5_IRQHandler                (void) __attribute__ ((weak, alias("Default_Handler")));
void GPIOM_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler")));
void GPION_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler")));
void GPIOP_IRQHandler               (void) __attribute__ ((weak, alias("Default_Handler")));
void GPIOP1_IRQHandler              (void) __attribute__ ((weak, alias("Default_Handler")));
void GPIOP2_IRQHandler              (void) __attribute__ ((weak, alias("Default_Handler")));
void GPIOP3_IRQHandler              (void) __attribute__ ((weak, alias("Default_Handler")));
void GPIOP4_IRQHandler              (void) __attribute__ ((weak, alias("Default_Handler")));
void GPIOP5_IRQHandler              (void) __attribute__ ((weak, alias("Default_Handler")));
void GPIOP6_IRQHandler              (void) __attribute__ ((weak, alias("Default_Handler")));
void GPIOP7_IRQHandler              (void) __attribute__ ((weak, alias("Default_Handler")));
void PWM1_GE0_IRQHandler            (void) __attribute__ ((weak, alias("Default_Handler")));
void PWM1_GE1_IRQHandler            (void) __attribute__ ((weak, alias("Default_Handler")));
void PWM1_GE2_IRQHandler            (void) __attribute__ ((weak, alias("Default_Handler")));
void PWM1_GE3_IRQHandler            (void) __attribute__ ((weak, alias("Default_Handler")));
void PWM1_FAULT_IRQHandler          (void) __attribute__ ((weak, alias("Default_Handler")));


//*****************************************************************************
//
// Reserve space for the system stack.
//
//*****************************************************************************
#ifndef STACK_SIZE
#define STACK_SIZE                              256
#endif
static unsigned long pulStack[STACK_SIZE];

//*****************************************************************************
//
// The minimal vector table for a Cortex-M3.  Note that the proper constructs
// must be placed on this to ensure that it ends up at physical address
// 0x0000.0000.
//
//*****************************************************************************
__attribute__ ((section(".isr_vector")))
void (* const g_pfnVectors[])(void) = {
    (void (*)(void))((unsigned long)pulStack + sizeof(pulStack)),
    // The initial stack pointer
    Reset_Handler,                            /*      Reset Handler             */
    NMI_Handler,                              /*      NMI Handler               */
    HardFault_Handler,                        /*      Hard Fault Handler        */
    MemManage_Handler,                        /*      MPU Fault Handler         */
    BusFault_Handler,                         /*      Bus Fault Handler         */
    UsageFault_Handler,                       /*      Usage Fault Handler       */
    0,                                        /*      Reserved                  */
    0,                                        /*      Reserved                  */
    0,                                        /*      Reserved                  */
    0,                                        /*      Reserved                  */
    SVC_Handler,                              /*      SVCall Handler            */
    DebugMon_Handler,                         /*      Debug Monitor Handler     */
    0,                                        /*      Reserved                  */
    PendSV_Handler,                           /*      PendSV Handler            */
    SysTick_Handler,                          /*      SysTick Handler           */

