peterliu2/FreeRTOS/FreeRTOS/Demo/CORTEX_TM4C123GH6PGE_GCC/init/startup.c
    /* External interrupts */
    GPIOA_IRQHandler,                         /*  0:  GPIO Port A				*/
    GPIOB_IRQHandler,                         /*  1:  GPIO Port B				*/
    GPIOC_IRQHandler,                         /*  2:  GPIO Port C				*/
    GPIOD_IRQHandler,                         /*  3:  GPIO Port D				*/
    GPIOE_IRQHandler,                         /*  4:  GPIO Port	E				*/
    UART0_IRQHandler,                         /*  5:  UART 0					*/
    UART1_IRQHandler,                         /*  6:  UART 1					*/
    SSI0_IRQHandler,						  /*  7:  SSI0						*/
    I2C0_IRQHandler,                          /*  8:  I2C0						*/
    PWM0_FAULT_IRQHandler,                    /*  9:  PWM0 Fault				*/
    PWM0_GE0_IRQHandler,                      /* 10:  PWM0 Generator 0			*/
    PWM0_GE1_IRQHandler,                      /* 11:  PWM0 Generator 1			*/
    PWM0_GE2_IRQHandler,                      /* 12:  PWM0 Generator 2			*/
    QEI0_IRQHandler,                          /* 13:  QEI0						*/
    ADC0_SEQ0_IRQHandler,                     /* 14:  ADC0 Sequence 0			*/
    ADC0_SEQ1_IRQHandler,                     /* 15:  ADC0 Sequence 1			*/
    ADC0_SEQ2_IRQHandler,                     /* 16:  ADC0 Sequence 2			*/
    ADC0_SEQ3_IRQHandler,                     /* 17:  ADC0 Sequence 3			*/
    WT01_IRQHandler,                          /* 18:  Watchdog Timers 0 and 1	*/
    TIMER_0A_IRQHandler,                      /* 19:  16/32-Bit Timer 0A		*/
    TIMER_0B_IRQHandler,                      /* 20:  16/32-Bit Timer 0B		*/
    TIMER_1A_IRQHandler,                      /* 21:  16/32-Bit Timer 1A		*/
    TIMER_1B_IRQHandler,                      /* 22:  16/32-Bit Timer 1B		*/
    TIMER_2A_IRQHandler,                      /* 23:  16/32-Bit Timer 2A		*/
    TIMER_2B_IRQHandler,                      /* 24:  16/32-Bit Timer 2B		*/
    ANALOG_CMP0_IRQHandler,                   /* 25:  Analog Comparator 0		*/
    ANALOG_CMP1_IRQHandler,                   /* 26:  Analog Comparator 1		*/
    ANALOG_CMP2_IRQHandler,                   /* 27:  Analog Comparator 2		*/
    SYSTEM_CTL_IRQHandler,                    /* 28:  System control			*/
    FLASH_EEPROM_CTL_IRQHandler,              /* 29:  Flash Memory Control and EEPROM Control*/
    GPIOF_IRQHandler,                         /* 30:  GPIO Port F				*/
    GPIOG_IRQHandler,                         /* 31:  GPIO Port G				*/
    GPIOH_IRQHandler,                         /* 32:  GPIO Port H				*/
    UART2_IRQHandler,                         /* 33:  UART 2					*/
    SSI1_IRQHandler,						  /* 34:  SSI1						*/
    TIMER_3A_IRQHandler,                      /* 35:  16/32-Bit Timer 3A		*/
    TIMER_3B_IRQHandler,                      /* 36:  16/32-Bit Timer 3B		*/
    I2C1_IRQHandler,                          /* 37:  I2C1						*/
    QEI1_IRQHandler,                          /* 38:  QEI1						*/
    CAN0_IRQHandler,						  /* 39:  CAN0						*/
    CAN1_IRQHandler,						  /* 40:  CAN1						*/
    0,										  /* 41:  Reserved					*/
    0,										  /* 42:  Reserved					*/
    HIB_MODULE_IRQHandler,                    /* 43:  Hibernation Module		*/
    USB_IRQHandler,							  /* 44:  Hibernation Module		*/
    PWM_GE3_IRQHandler,                       /* 45:  PWM Generator 3			*/
    uDMA_SOFTWARE_IRQHandler,                 /* 46:  uDMA Software				*/
    uDMA_ERROR_IRQHandler,                    /* 47:  uDMA Error				*/
    ADC1_SEQ0_IRQHandler,                     /* 48:  ADC1 Sequence 0			*/
    ADC1_SEQ1_IRQHandler,                     /* 49:  ADC1 Sequence 1			*/
    ADC1_SEQ2_IRQHandler,                     /* 50:  ADC1 Sequence 2			*/
    ADC1_SEQ3_IRQHandler,                     /* 51:  ADC1 Sequence 3			*/
    0,										  /* 52:  Reserved					*/
    0,										  /* 53:  Reserved					*/
    GPIOJ_IRQHandler,                         /* 54:  GPIO Port J				*/
    GPIOK_IRQHandler,                         /* 55:  GPIO Port K				*/
    GPIOL_IRQHandler,                         /* 56:  GPIO Port L				*/
    SSI2_IRQHandler,						  /* 57:  SSI2						*/
    SSI3_IRQHandler,						  /* 58:  SSI3						*/
    UART3_IRQHandler,                         /* 59:  UART 3					*/
    UART4_IRQHandler,                         /* 60:  UART 4					*/
    UART5_IRQHandler,                         /* 61:  UART 5					*/
    UART6_IRQHandler,                         /* 62:  UART 6					*/
    UART7_IRQHandler,                         /* 63:  UART 7					*/
    0,										  /* 64:  Reserved					*/
    0,										  /* 65:  Reserved					*/
    0,										  /* 66:  Reserved					*/
    0,										  /* 67:  Reserved					*/
    I2C2_IRQHandler,                          /* 68:  I2C2						*/
    I2C3_IRQHandler,                          /* 69:  I2C3						*/
    TIMER_4A_IRQHandler,                      /* 70:  16/32-Bit Timer 4A		*/
    TIMER_4B_IRQHandler,                      /* 71:  16/32-Bit Timer 4B		*/
    0,										  /* 72:  Reserved					*/
    0,										  /* 73:  Reserved					*/
    0,										  /* 74:  Reserved					*/
    0,										  /* 75:  Reserved					*/
    0,										  /* 76:  Reserved					*/
    0,										  /* 77:  Reserved					*/
    0,										  /* 78:  Reserved					*/
    0,										  /* 79:  Reserved					*/
    0,										  /* 80:  Reserved					*/
    0,										  /* 81:  Reserved					*/
    0,										  /* 82:  Reserved					*/
    0,										  /* 83:  Reserved					*/
    0,										  /* 84:  Reserved					*/
    0,										  /* 85:  Reserved					*/
    0,										  /* 86:  Reserved					*/
    0,										  /* 87:  Reserved					*/
    0,										  /* 88:  Reserved					*/
    0,										  /* 89:  Reserved					*/
    0,										  /* 90:  Reserved					*/
    0,										  /* 91:  Reserved					*/
    TIMER_5A_IRQHandler,                      /* 92:  16/32-Bit Timer 5A		*/
    TIMER_5B_IRQHandler,                      /* 93:  16/32-Bit Timer 5B		*/
    TIMER_32BIT_0A_IRQHandler,                /* 94:  32/64-Bit Timer 0A		*/
    TIMER_32BIT_0B_IRQHandler,                /* 95:  32/64-Bit Timer 0B		*/
    TIMER_32BIT_1A_IRQHandler,                /* 96:  32/64-Bit Timer 1A		*/
    TIMER_32BIT_1B_IRQHandler,                /* 97:  32/64-Bit Timer 1B		*/
    TIMER_32BIT_2A_IRQHandler,                /* 98:  32/64-Bit Timer 2A		*/
    TIMER_32BIT_2B_IRQHandler,                /* 99:  32/64-Bit Timer 2B		*/
    TIMER_32BIT_3A_IRQHandler,                /* 100: 32/64-Bit Timer 3A		*/
    TIMER_32BIT_3B_IRQHandler,                /* 101: 32/64-Bit Timer 3B		*/
    TIMER_32BIT_4A_IRQHandler,                /* 102: 32/64-Bit Timer 4A		*/
    TIMER_32BIT_4B_IRQHandler,                /* 103: 32/64-Bit Timer 4B		*/
    TIMER_32BIT_5A_IRQHandler,                /* 104: 32/64-Bit Timer 5A		*/
    TIMER_32BIT_5B_IRQHandler,                /* 105: 32/64-Bit Timer 5B		*/
    SYS_EXCEP_IRQHandler,					  /* 106: System Exception(imprecise)*/
    0,										  /* 107: Reserved					*/
    0,										  /* 108: Reserved					*/
    I2C4_IRQHandler,                          /* 109: I2C4						*/
    I2C5_IRQHandler,                          /* 110: I2C5						*/
    GPIOM_IRQHandler,                         /* 111: GPIO Port M				*/
    GPION_IRQHandler,                         /* 112: GPIO Port N				*/
    0,										  /* 113: Reserved					*/
    0,										  /* 114: Reserved					*/
    0,										  /* 115: Reserved					*/
    GPIOP_IRQHandler,                         /* 116: GPIO Port P(Summary or P0)*/
    GPIOP1_IRQHandler,                        /* 117: GPIO Port P1				*/
    GPIOP2_IRQHandler,                        /* 118: GPIO Port P2				*/
    GPIOP3_IRQHandler,                        /* 119: GPIO Port P3				*/
    GPIOP4_IRQHandler,                        /* 120: GPIO Port P4				*/
    GPIOP5_IRQHandler,                        /* 121: GPIO Port P5				*/
    GPIOP6_IRQHandler,                        /* 122: GPIO Port P6				*/
    GPIOP7_IRQHandler,                        /* 123: GPIO Port P7				*/
    0,										  /* 124: Reserved					*/
    0,										  /* 125: Reserved					*/
    0,										  /* 126: Reserved					*/
    0,										  /* 127: Reserved					*/
    0,										  /* 128: Reserved					*/
    0,										  /* 129: Reserved					*/
    0,										  /* 130: Reserved					*/
    0,										  /* 131: Reserved					*/
    0,										  /* 132: Reserved					*/
    0,										  /* 133: Reserved					*/
    PWM1_GE0_IRQHandler,                      /* 134: PWM1 Generator 0			*/
    PWM1_GE1_IRQHandler,                      /* 135: PWM1 Generator 1			*/
    PWM1_GE2_IRQHandler,                      /* 136: PWM1 Generator 2			*/
    PWM1_GE3_IRQHandler,                      /* 137: PWM1 Generator 2			*/
    PWM1_FAULT_IRQHandler,                    /* 138: PWM1 Fault				*/
};

//*****************************************************************************
//
// The following are constructs created by the linker, indicating where the
// the "data" and "bss" segments reside in memory.  The initializers for the
// for the "data" segment resides immediately following the "text" segment.
//
//*****************************************************************************
extern unsigned long _text;
extern unsigned long _etext;
extern unsigned long _data;
extern unsigned long _edata;
extern unsigned long _bss;
extern unsigned long _ebss;
extern unsigned long _ldata;

//*****************************************************************************
//
// This is the code that gets called when the processor first starts execution
// following a reset event.  Only the absolutely necessary set is performed,
// after which the application supplied main() routine is called.  Any fancy
// actions (such as making decisions based on the reset cause register, and
// resetting the bits in that register) are left solely in the hands of the
// application.
//
//*****************************************************************************
void Reset_Handler(void)
{
    uint32_t *pulSrc, *pulDest;

