peterliu2/FreeRTOS/FreeRTOS/Demo/CORTEX_TM4C123GH6PGE_GCC/init/startup.c
    // Copy the data segment initializers from flash to SRAM.
    pulSrc = &_ldata;
    for(pulDest = &_data; pulDest < &_edata; ) {
        *pulDest++ = *pulSrc++;
    }

    // Zero fill the bss segment.
    //for(pulDest = &_bss; pulDest < &_ebss; ) {
    //    *pulDest++ = 0;
    //}

    // Zero fill the bss segment.
    __asm(	"    ldr     r0, =_bss\n"
            "    ldr     r1, =_ebss\n"
            "    mov     r2, #0\n"
            "    .thumb_func\n"
            "zero_loop:\n"
            "        cmp     r0, r1\n"
            "        it      lt\n"
            "        strlt   r2, [r0], #4\n"
            "        blt     zero_loop");

    // Call the application's entry point.
    main();
}

//*****************************************************************************
//
// This is the code that gets called when the processor receives a NMI.  This
// simply enters an infinite loop, preserving the system state for examination
// by a debugger.
//
//*****************************************************************************
static void NMI_Handler(void)
{
    // Enter an infinite loop.
    while(1) {
    }
}

//*****************************************************************************
//
// This is the code that gets called when the processor receives a fault
// interrupt.  This simply enters an infinite loop, preserving the system state
// for examination by a debugger.
//
//*****************************************************************************
static void HardFault_Handler(void)
{
    // Enter an infinite loop.
    while(1) {
    }
}

//*****************************************************************************
//
// This is the code that gets called when the processor receives an unexpected
// interrupt.  This simply enters an infinite loop, preserving the system state
// for examination by a debugger.
//
//*****************************************************************************
static void Default_Handler(void)
{
    // Go into an infinite loop.
    while(1) {
    }
}

